app/Http/Requests/MakeLoginRequest.php

select * from `usuarios` where `email` = 'admin@example.com' limit 1
select * from `admins` where `email` = 'admin@example.com' limit 1
---
    public function tryToLogin(): bool{

        $usuario = Usuario::where('email', $this->input('email'))->first();

        if ($usuario && Hash::check($this->input('password'), $usuario->password)) {
            Auth::guard('web_usuario')->login($usuario);
            return true;
        }

        $usuarioadmin = Admin::where('email', $this->input('email'))->first();