app/Http/Controllers/adminAdm.php

    public function __invoke(){
        $adminLogado = auth('web_admin')->user();
        $admins = Admin::where('id', $adminLogado->id)->orWhere('criador_id', $adminLogado->id)->paginate(10);
---
select * from `admins` where `id` = 1 or `criador_id` = 1 limit 10 offset 0
select count(*) as aggregate from `admins` where `id` = 1 or `criador_id` = 1