app/Http/Controllers/comprasAdm.php

select * from `vendas` where `comprador_id` = 1
select count(*) as aggregate from `vendas` where `comprador_id` = 1
---
    public function __invoke(){

        $user = auth()->guard('web_usuario')->user();
        $compras = Venda::where('comprador_id', $user->id)->paginate(10);