app/Http/Controllers/produtosAdm.php

    public function __invoke(){
        if(auth()->guard('web_admin')->check()){
            $produtos = Produto::paginate(10);
        }
        elseif(auth()->guard('web_usuario')->check()){
            $user = auth()->guard('web_usuario')->user();
            $produtos = Produto::where('usuario_id', $user->id)->paginate(10);
---
select * from `produtos` limit 10 offset 0
select count(*) as aggregate from `produtos`
select * from `produtos` where `usuario_id` = 1 limit 10 offset 0
select count(*) as aggregate from `produtos` where `usuario_id` = 1