app/Http/Controllers/UsuariosAdm.php

    public function __invoke(){
        if(auth()->guard('web_admin')->check()){
            $usuarios = Usuario::paginate(10);
---
select * from `usuarios` limit 10 offset 0
select count(*) as aggregate from `usuarios`