app/Http/Controllers/vendasAdm.php

select * from `vendas` limit 10 offset 0
select count(*) as aggregate from `vendas`
select * from `vendas` where `vendedor_id` = 1 limit 10 offset 0
select count(*) as aggregate from `vendas` where `vendedor_id` = 1
---
    public function __invoke(){
        if(auth()->guard('web_admin')->check()){
            $vendas = Venda::paginate(10);
            return view('vendas.vendasAdm' , compact('vendas'));
        }
        elseif(auth()->guard('web_usuario')->check()){
            $user = auth()->guard('web_usuario')->user();
            $vendas = Venda::where('vendedor_id', $user->id)->paginate(10);